{"fr":
	{
		"Puzzle":"Puzzle",
		"Error":"Erreur",
		"Error while trying to retrieve the data":"Erreur en essayant de récupérer les données",
		"Yes":"Oui",
		"No":"Non",
		"Choose an image":"Choisir une image",
		"Image stored on the user's device":"Image stockée sur la machine de l'utilisateur",
		"Upload an image:":"Téléversez une image :",
		"Image stored on a server":"Image stockée sur un serveur",
		"Click on one of the images below:":"Cliquez sur l'une des images ci-dessous :",
		"Select one of your images:":"Sélectionnez l'une de vos images :",
		"Select one of the images below:":"Sélectionnez l'une des images ci-dessous :",
		"You can also select one of the images below by clicking on it:":"Vous pouvez aussi sélectionnez l'une des images ci-dessous en cliquant dessus :",
		"Drag and drop one of your images here or select one by clicking the button below:":"Déposez l'une de vos images ici ou sélectionnez-en une en cliquant sur le bouton ci-dessous :",
		"Settings":"Préférences",
		"Modify":"Modifier",
		"ready to restart":"prêt à recommencer",
		"Alert":"Alerte",
		"Impossible to restart while a puzzle is being built!":"Impossible de recommencer pendant la construction d'un puzzle !",
		"Impossible to change the settings while a puzzle is being built!":"Impossible de modifier les préférences pendant la construction d'un puzzle !",
		"Accessibility":"Accessibilité",
		"Screen reader":"Lecteur d'écran",
		"If you are using a screen reader, it is recommended that you choose the following settings:":"Si vous utilisez un lecteur d'écran, il est conseillé de choisir les paramètres suivants :",
		"Piece type: squared or curvy":"Type de pièce : carré ou arrondi",
		"Match threshold: 60":"Seuil de correspondance : 60",
		"Keyboard navigation increment: 100":"Incrément navigation clavier : 100",
		"Round initial coordinates: checked":"Arrondir les coordonnées initiales : coché",
		"If a puzzle is w pieces wide by h pieces high, the piece in the northwest corner has coordinates (1, 1) and the one in the southeast corner has coordinates (w, h).":"Si un puzzle a w pièces de large sur h pièces de haut, la pièce du coin nord-ouest a les coordonnées (1, 1) et celle du coin sud-est a les coordonnées (w, h).",
		"Keyboard navigation":"Navigation clavier",
		"Use the Tab and Shift + Tab keys to move the focus.":"Utilisez les touches Tab et Maj + Tab pour déplacer le focus.",
		"Use the Enter key or the Space bar to activate a button.":"Utilisez la touche Entrée ou la barre d'espace pour activer un bouton.",
		"Shortcuts":"Raccourcis",
		"open the Accessibility dialog":"ouvre le dialogue Accessibilité",
		"open the Tips and Tricks dialog":"ouvre le dialogue Trucs et astuces",
		"if a screen reader is activated, describe the selection area if any or the selected puzzle elements if any or the puzzle element in focus":"Si un lecteur d'écran est activé, décrit la zone de sélection, ou les éléments du puzzle sélectionnés, ou l'élément du puzzle qui a le focus",
		"if a screen reader is activated, may describe the puzzle elements in more detail (for example, when the type of pieces is \"quirky\")":"si un lecteur d'écran est activé, peut décrire les éléments du puzzle plus en détail (par exemple quand le type des pièces est \"décalé\")",
		"cancel the selection and blur focus (useful when one then wants to scroll the window content)":"annule la sélection et retire le focus de l'élément courant (utile lorsque l'on souhaite ensuite faire défiler le contenu de la fenêtre)",
		"open the Preferences dialog":"ouvre le dialogue Préférences",
		"reframe the puzzle to fit the window":"recadre le puzzle pour l'adapter à la fenêtre",
		"focus on the Restart button":"focus sur le bouton Recommencer",
		"focus on the model":"focus sur le modèle",
		"focus on the Home button":"focus sur le bouton Accueil",
		"remove the focus from the puzzle elements":"retire le focus des éléments du puzzle",
		"focus on the first puzzle element":"focus sur le premier élément du puzzle",
		"give the focus to a puzzle element":"donne le focus à un élément du puzzle",
		"the last one to have been in focus or the first one on the list of elements if no puzzle element is in focus":"le dernier à avoir eu le focus ou le premier de la liste des éléments si aucun élement du puzzle n'a le focus",
		"the last one to have been in focus or the last one on the list of elements if no puzzle element is in focus":"le dernier à avoir eu le focus ou le dernier de la liste des éléments si aucun élement du puzzle n'a le focus",
		"the previous or the last one in the list of elements if a puzzle element is already in focus":"le précédent ou le dernier de la liste des éléments si un élément du puzzle a déjà le focus",
		"the next or the first one in the list of elements if a puzzle element is already in focus":"le suivant ou le premier de la liste des éléments si un élément du puzzle a déjà le focus",
		"focus on the next puzzle element not already in its final place":"focus sur l'élément suivant du puzzle pas encore à sa place finale",
		"focus on a puzzle element not already in its final place, located several elements after the current focused element":"focus sur un élément du puzzle pas encore à sa place finale, situé plusieurs éléments après l'élément ayant le focus",
		"focus on the last puzzle element not already in its final place":"focus sur le dernier élément du puzzle pas encore à sa place finale",
		"focus on a puzzle element not already in its final place":"focus sur un élément du puzzle pas encore à sa place finale",
		"Space bar":"Barre d'espace",
		"Shift + ":"Maj + ",
		"Selection and moving":"Sélection et déplacement",
		"When a puzzle element receives the focus, it is automatically selected and all previously selected elements are unselected.":"Lorsqu'un élément du puzzle reçoit le focus, il est automatiquement sélectionné et tous les éléments précédemment sélectionnés sont désélectionnés.",
		" Then it can be moved with the arrow keys.":" On peut ensuite le déplacer à l'aide des touches fléchées.",
		"It is also possible to select and move one or multiple puzzle elements simultaneously by using a selection area:":"Il est également possible de sélectionner et de déplacer un ou plusieurs éléments du puzzle simultanément en utilisant une zone de sélection :",
		"Create a selection area with the Shift + arrow keys":"Créez une zone de sélection à l'aide des touches Maj + flèches",
		"Enlarge or reduce the selection area with the Shift + arrow keys":"Agrandissez ou réduisez la zone de sélection à l'aide des touches Maj + flèches",
		"Move the selection area without its content with the arrow keys":"Déplacez la zone de sélection sans son contenu à l'aide des touches fléchées",
		"Validate the selection of the top most puzzle element that is in the selection area with the Space bar":"Validez la sélection de l'élément du puzzle situé le plus au dessus dans la zone de sélection avec la barre d'espace",
		"Or validate the selection of all the puzzle elements that are in the selection area with the Shift key + the Space bar":"Ou bien validez la sélection de tous les éléments du puzzle qui se trouvent dans la zone de sélection avec la touche Maj + barre d'espace",
		"Move the selected puzzle elements with the arrow keys":"Déplacez les éléments du puzzle sélectionnés à l'aide des touches fléchées",
		"Gluing":"Assemblage",
		"Use the Space bar to glue together the selected puzzle elements to its neighbors if they match.":"Utilisez la barre d'espace pour assembler les éléments du puzzle sélectionnés avec leurs voisins s'ils correspondent.",
		"Miscellalenous":"Divers",
		"To change the size of the model image, give it the focus then use the arrow keys.":"Pour modifier la taille de l'image du modèle, donnez-lui le focus puis utilisez les touches fléchées.",
		"Choose an image":"Choisir une image",
		"Open":"Ouvrir",
		"Reframe":"Recadrer",
		"Restart":"Recommencer",
		"Home":"Accueil",
		"Model":"Modèle",
		"Game over":"Fin du jeu",
		"Well done! The puzzle is complete!":"Bravo ! Le puzzle est terminé !",
		"OK":"OK",
		"Cancel":"Annuler",
		"Reset":"Réinitialiser",
		"Default values":"Valeurs par défaut",
		". ":". ",
		": ":" : ",
		", ":", ",
		" ":" ",
		"puzzle element":"élément du puzzle",
		"puzzle element on":"élément du puzzle en",
		"element of ":"élément de ",
		" on ":" en ",
		" to ":" à ",
		"the north":"le nord",
		"the east":"l'este",
		"the south":"le sud",
		"the west":"l'ouest",
		"north edge":"bord nord",
		"east edge":"bord este",
		"south edge":"bord sud",
		"west edge":"bord ouest",
		"northeast point":"point nord-este",
		"southeast point":"point sud-este",
		"southwest point":"point sud-ouest",
		"northwest point":"point nord-ouest",
		"tenon":"tenon",
		"big tenon":"grand tenon",
		"medium tenon":"tenon moyen",
		"small tenon":"petit tenon",
		"mortise":"mortaise",
		"big mortise":"grande mortaise",
		"medium mortise":"mortaise moyenne",
		"small mortise":"petite mortaise",
		"straight":"droit",
		"offset to ":"décalé vers ",
		"very far to ":"très décalé vers ",
		"slightly to ":"légèrement décalé vers ",
		"centered":"centré",
		"starting point":"point de départ",
		"piece":"pièce",
		"pieces":"pièces",
		"piece at ":"pièce en ",
		"already glued":"déjà assemblé",
		"glued pieces":"pièces assemblées",
		"straight, completed":"droit, complet",
		"Preferences":"Préférences",
		"Number of puzzle pieces (approximate)":"Nombre de pièces du puzzle (approximatif)",
		"Piece type":"Type de pièce",
		"squared":"carré",
		"curvy":"arrondi",
		"quirky":"décalé",
		"Emboss":"Embossage",
		"Match threshold (in %)":"Seuil de correspondance (en %)",
		"Keyboard navigation increment (in %)":"Incrément navigation clavier (en %)",
		"Round initial coordinates":"Arrondir les coordonnées initiales",
		"Gluing when matching":"Assemblage si correspondance",
		"Internal borders":"Bordures internes",
		"Show the stopwatch":"Afficher le chronomètre",
		"Show the score":"Afficher le score",
		"Show the model":"Afficher le modèle",
		"Scattering":"Éparpillement",
		"Inside":"À l'intérieur",
		"Outside":"À l'extérieur",
		"Background color":"Couleur du fond",
		"Beep when matching":"Beep si correspondance",
		"Sorry, cannot open this file!":"Désolé, impossible d'ouvrir ce fichier !",
		"Sorry, too long! Please reduce the number of pieces via the \"Preferences\" button!":"Désolé, trop long! Merci de réduire le nombre de pièces via le bouton \"Préférences\" !",
		"Sorry, too long! Please choose a lighter image or reduce the number of pieces via the \"Preferences\" button!":"Désolé, trop long! Merci de choisir une image plus légère ou de réduire le nombre de pièces via le bouton \"Préférences\" !",
		"Please wait!":"Merci de patienter !",
		"A puzzle has not been completed.":"Un puzzle n'a pas été terminé.",
		"The puzzle has not been completed.":"Le puzzle n'a pas été terminé.",
		"Do you still want to restart it?":"Voulez-vous le recommencer quand même ?",
		"About this image":"À propos de cette image",
		"To launch the puzzle, click on the image!":"Pour lancer le puzzle, cliquez sur l'image !",
		"generated by an AI":"générée par une IA",
		"Public domain":"Domaine public",
		"Title":"Titre",
		"Title: ":"Titre : ",
		"Credits":"Crédits",
		"Credits: ":"Crédits : ",
		"Source":"Source",
		"Source: ":"Source : ",
		"License":"Licence",
		"License: ":"Licence : ",
		"Animals":"Animaux",
		"Art":"Art",
		"Building":"Constructions",
		"Clothing":"Vêtements",
		"Flags":"Drapeaux",
		"Landscapes":"Paysages",
		"Miscellaneous":"Divers",
		"Objects":"Objets",
		"Plants":"Plantes",
		"Transport":"Transport",
		"Restore":"Restaurer",
		"Do not restore":"Ne pas restaurer",
		"Puzzle of ":"Puzzle de ",
		" by ":" par ",
		" pieces":" pièces",
		"Rotation":"Rotation",
		"Match found!":"Correspondance trouvée !",
		"Elements remaining to be glued":"Éléments restant à assembler",
		" out of ":" sur ",
		"Selection area at ":"Zone de sélection en ",
		"Selection area created at ":"Zone de sélection créée en ",
		"Selection area modified at ":"Zone de sélection modifiée en ",
		"Selection area moved to ":"Zone de sélection déplacée en ",
		"width: ":"largeur : ",
		"height: ":"hauteur : ",
		"Multiple elements selected!":"Sélection multiple !",
		" selected puzzle elements! ":" éléments du puzzle sélectionnés ! ",
		" selected puzzle element! ":" élément du puzzle sélectionné ! ",
		"Nothing is selected or is in focus anymore.":"Plus rien n'est sélectionné ni n'a le focus.",
		"external perimeter starting at ":"périmètre externe commençant en ",
		"internal perimeter starting at ":"périmètre interne commençant en ",
		"Are my images sent over the internet?":"Mes images sont-elles envoyées sur internet ?",
		"No, this application does not send anything over the internet.":"Non, cette application n'envoie rien sur internet.",
		"Where can I find instructions for keyboard navigation?":"Où trouver les instructions pour la navigation au clavier ?",
		"When a puzzle is displayed, click on the accessibility button.":"Lorsqu'un puzzle est affiché, cliquez sur le bouton d'accessibilité.",
		"How can I move multiple puzzle pieces simultaneously with the mouse?":"Comment déplacer plusieurs pièces du puzzle simultanément avec la souris ?",
		"You can select and then move multiple pieces with the mouse using the following method:":"Vous pouvez sélectionner puis déplacer plusieurs pièces du puzzle simultanément avec la souris en utilisant la méthode suivante :",
		"click where there is nothing while holding down the button of the mouse,":"cliquez là où il n'y a rien tout en maintenant le bouton de la souris enfoncé,",
		"release the mouse button; the grey rectangle remains visible, and the pieces inside the rectangle are selected,":"relâcher la souris, le rectangle gris reste visible, les pièces à l'intérieur du rectangle sont sélectionnées,",
		"move the mouse, a grey rectangle appears,":"déplacez la souris, un rectangle gris apparaît,",
		"click on one of the selected pieces while holding down the button of the mouse,":"cliquez sur une des pièces sélectionnées en maintenant le bouton de la souris enfoncée,",
		"move the mouse, all the selected pieces will move,":"déplacez la souris, toutes les pièces sélectionnées sont déplacées,",
		"to make the selection rectangle disappear, click somewhere other than on a selected piece.":"pour faire disparaitre le rectangle de sélection, cliquez ailleurs que sur une pièce sélectionnée.",
		"How do I zoom in and out?":"Comment zoomer ?",
		"Use the browser's zoom function. To reduce (or enlarge) the puzzle pieces while maintaining the initial zoom level for text and buttons, zoom in (or zoom out), then click the Reframe button, then zoom out (or zoom in).":"Utilisez le zoom du navigateur. Pour réduire (ou agrandir) les pièces du puzzle tout en conservant le niveau de zoom initial pour le texte et les boutons, effectuez un zoom avant (ou arrière), puis cliquez sur le bouton Recadrer, puis effectuez un zoom arrière (ou avant).",
		"How do I change the size of the model image with the mouse?":"Comment changer la taille de l'image du modèle avec la souris ?",
		"Click on the model image, then move the mouse while holding down its button.":"Cliquez sur l'image du modèle et déplacez la souris en maintenant son bouton enfoncé.",
		"When the Rotation option is enabled, how can I rotate the puzzle elements?":"Lorsque l'option Rotation est activée, comment faire pivoter les éléments du puzzle ?",
		"Simply double-click on it.":"Il vous suffit de double-cliquer dessus.",
		"When the Rotation option is enabled, to rotate a puzzle element, give it the focus then press Shift key + Spacebar.":"Lorsque l'option Rotation est activée, pour faire pivoter un élément du puzzle, donnez-lui le focus et appuyez sur la touche Maj + barre d'espace.",
		"Tips and Tricks":"Trucs et astuces",
		"Read":"Lire",
		"again":"à nouveau"
	}
}
